app/controllers/recipes_controller.rb

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 0)

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 0)

  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save
---
INSERT INTO `recipes` (`title`, `date`, `description`, `instructions`) VALUES('Hot Chips', '2009-02-08', 'Only for the brave!', 'Sprinkle hot-pepper sauce on hot chips.')

  def update
    @recipe = Recipe.find(params[:id])

    respond_to do |format|
      if @recipe.update_attributes(params[:recipe])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 0)
UPDATE `recipes` SET `category_id` = '2', `instructions` = '\r\nSprinkle hot-pepper sauce on hot chips.\r\n\r\n' WHERE `id` = 0

  def search
   @recipes = Recipe.find(:all, :conditions => ["title LIKE ?", "%#{params[:key]}%"])
---
SELECT * FROM `recipes` WHERE (title LIKE '%hot%')